const imageMap = {
    "one": "./img/nis.png",
    "two": "./img/stracino-kumanovska.png",
    "three": "./img/kosovo.png",
    "four": "./img/drava.png",
    "five": "./img/murska.png"
};

const titleMap = {
    "one": "Нишка операция",
    "two": "Страцинско-Кумановска операция",
    "three": "Косовска операция",
    "four": "Дравска операция",
    "five": "Мурска операция"
};

const descriptionMap = {
    "one": ["Нишката операция е настъпателна операция, организирана и проведена от 2-ра българска армия, подпомогната от части на 13-и корпус на НОВЮ и 3-ти украински фронт в периода 8 – 14 октомври 1944 г., със задача настъпление по направлението София – Ниш, разгромяване на германските войски, овладяване на района на Ниш и прекъсване на пътищата на оттеглящите се германски войски от Гърция и Егейските острови", "Операцията има както стратегически – овладян е важният пътен възел Ниш, така и политически – отечественофронтовска България доказва решимостта си да воюва срещу Нацистка Германия.", "Загубите на българските войски в лицето на 2-ра армия са 1665 убити, ранени и изчезнали."],
    "two": ["Страцинско-Кумановската операция е настъпателна операция на българската армия по време на участието на България във Втората световна война срещу войски на Третия райх, отбраняващи подстъпите към долината на река Вардар.", "Проведена е от 8 октомври до 14 ноември 1944, провеждана успоредно с Нишката настъпателна операция и Брегалнишко-струмишката настъпателна операция.", "Операцията се провежда с цел да се пресече пътят за отстъпление на група немски армии „Е“ от Гърция към Централна Европа."],
    "three": ["Косовската операция е настъпателна операция на българската армия по време на участието на България във Втората световна война срещу войски на Третия райх (малко повече от две дивизии), разположени в района на Майдан планина, Преполац и планината Голак. Проведена е в периода 21 октомври - 21 ноември 1944 г. Целта ѝ е да се прекъсне пътя на оттеглящите се от Гърция група армии „Е“ на Вермахта.", "С Косовската операция завършва първата фаза на участието на България във Втората световна война на страната на антихитлеристката коалиция."],
    "four": ["Дравската операция или Дравска епопея е отбранителна операция на българската армия по време на участието на България във Втората световна война срещу войски на Третия райх, настъпващи в района на Нагятад-Хересне в опит да създадат предмостие на северния бряг на река Драва. Тя е част от отбранителната Балатонска операция на Червената армия от периода 6 до 21 март 1945.", "Успешното провеждане на Дравската операция проваля настъпателните планове на Вермахта, спомага за създаване на условия за настъпателната Виенска операция на Червената армия и по този начин ускорява края на войната. Победата при Драва допринася и за бойния престиж на българската армия.", "Загубите на българската армия наброяват 1614 убити, а ранените са около 2500."],
    "five": ["Мурската операция е настъпателна операция на българската армия по време на участието на България във Втората световна война срещу войски на Третия райх, отбраняващи линията Кишбайом – Надкорпад – Нагятад – Хересне северно от река Драва. Проведена в периода 29 март до 13 май 1945 г. Целта на настъплението е да се прекрати използването от Вермахта на петролните извори в района на град Нагканижа.", "Вследствие на успешното настъпление на съветските войски, хитлеристките части южно от езерото Балатон се оттеглят, което облекчава настъплението на българите.", "Съюзниците подновяват настъплението, преследват, доразгромяват и пленяват остатъците от Вермахта и на 13 май 1945 достигат подножието на Австрийските Алпи в околностите на Клагенфурт."]
};

document.getElementById("battles").addEventListener("click", (e) => {
    let article = e.target.closest("article");

    if (article === null) {
        return;
    }

    document.body.style.overflow = "hidden";
    document.getElementById("lightbox").style.display = "flex";
    document.getElementById("lightbox-img").src = imageMap[article.id];

    let description = document.getElementById("lightbox-description");
    description.textContent = "";

    let title = document.createElement("h2");
    title.textContent = titleMap[article.id];

    description.appendChild(title);

    descriptionMap[article.id].forEach(element => {
        let row = document.createElement("p")
        row.textContent = element;

        description.append(row);
    });
});

document.getElementById("lightbox-close").addEventListener("click", (e) => {
    let article = e.target;

    if (article === null) {
        return;
    }

    document.body.style.overflow = "auto";
    document.getElementById("lightbox").style.display = "none";
});