const imageMap = {
    "one": "./img/hetzer.jpg",
    "two": "./img/jagpz4.jpg",
    "three": "./img/stug3.jpg",
    "four": "./img/pz4.jpg",
    "five": "./img/panther.jpg",
    "six": "./img/t34.jpg",
};

const titleMap = {
    "one": "Ягдпанцер 38 /Хетцер/",
    "two": "Ягдпанцер IV",
    "three": "Щурмгешюц III",
    "four": "Панцеркампфваген IV",
    "five": "Панцеркампфваген V /Пантера/",
    "six": "T-34-85",
};

const descriptionMap = {
    "one": ["Българската армия получава 4 броя „Хетцер“ на 17 март 1945 г. от трофейните складове на Трети украински фронт. Зачислени са като щурмово оръдие „Прага“. Заедно с 5 други щурмови оръдия с тях се формира щурмова батарея към бронираната дружина на Първа българска армия.", "Заемат позиции за отбрана в края на април 1945 г. край гр. Наканиджа, Унгария, където ги заварва и краят на бойните действия в Европа. ", "След войната са свалени от въоръжение и вероятно са заровени като ДОТ на южната граница."],
    "two": ["Тъй като танковият унищожител е разработен сравнително късно и започва да навлиза в бойните части на Вермахта едва през март 1944 г. той не е заложен в програмите за доставка на военна техника за съюзниците.", "По време на втората фаза на т.нар. Отечествена война 1944-45 г. от трофейните складове на Трети украински фронт са доставени 2 машини: една Jagdpanzer IV с оръдие Pak L/48 и една Panzer IV/70 (V).", "Получени са на 17 март 1945 г. в Унгария от българските военни и заедно с други трофейни щурмови оръдия формират щурмова батарея към бронираната бригада към Първа българска армия."],
    "three": ["Доставките за българската армия на самоходните оръдия Щурмгешюц III започват през май 1943 г. Те са договорени с Третия райх по програмата за доставки „Барбара“ и за периода май-декември 1943 г. са доставени 55 оръдия. Те са тип Sturmgeschutz 40 Ausf.G (Sd. Kzf.142/1). Доставяни са с два варианта на оръдейната маска – лята, тип Saukopf (свинска глава) и от заварени прави бронирани листове.", "След края на войната и подписването на мирния договор щурмовите оръдия са свалени от въоръжение и част от тях претопени. В средата на 50-те години останалите оръдия са вкопани като дълговременни огневи съоръжения по границата с Турция като част от укрепената отбранителна линия „Крали Марко“."],
    "four": ["До присъединяването на Царство България към Тристранния пакт на 1 март 1941 г. армията не разполага с германски танкове.", "В края на 1942 г. командването на армията оценява наличните машини в Бронирания полк като остарели и неотговарящи на изискванията за водене на съвременна война. ", "Взема се решение да се създадат бронирани бригади по образец на германските танкови дивизии. За основен танк е предложен Pz.Kpfw.IV (Sd. Kfz. 161/1)."],
    "five": ["За участието на Бронираната бригада във втората фаза на т.нар. Отечествена война (1944-1945 г.) (в състава на новосформираната Първа българска армия, която е част от Трети украински фронт) съветското командване изисква създаването на една рота с тежки танкове и две роти със средни танкове.", "Тъй като по това време бригадата не разполага с тежки танкове съветската страна поема ангажимент да достави такива от своите складове с трофейни машини. На 13 април 1945 г. са получени 15 трофейни танка Pz.Kpfw.V модификации Ausf.D2, Ausf.A и Ausf.G.", "В българската армия са заведени като бойна кола „Пантера“. Танковете са покрити с масленозелена боя и обозначени с червени петолъчки. Екипажите незабавно започват обучение на новата техника, но краят на войната в Европа попречва танковете да бъдат използвани в реални бойни действия."],
    "six": ["В България на 14 март 1945 г. са получени 65 танка Т-34-85. Те са зачислени в състава на създадената на 1 януари 1945 г. Втора бронирана бригада с гарнизон гр. Пловдив.", "По-късно към нея са прехвърлени 1-во и 2-ро ЩАО от Бронираната бригада. От 1 януари 1945 г. заедно със създаването на Втора бронирана бригада се отделя управление „Бронетанкови и механизирани войски“, като с него танковите войски се обособяват като самостоятелен род войски."]
};

document.getElementById("tanks").addEventListener("click", (e) => {
    let article = e.target.closest("article");

    if (article === null) {
        return;
    }

    document.body.style.overflow = "hidden";
    document.getElementById("lightbox").style.display = "flex";
    document.getElementById("lightbox-img").src = imageMap[article.id];

    let description = document.getElementById("lightbox-description");
    description.textContent = "";

    let title = document.createElement("h2");
    title.textContent = titleMap[article.id];

    description.appendChild(title);

    descriptionMap[article.id].forEach(element => {
        let row = document.createElement("p")
        row.textContent = element;

        description.append(row);
    });
});

document.getElementById("lightbox-close").addEventListener("click", (e) => {
    let article = e.target;

    if (article === null) {
        return;
    }

    document.body.style.overflow = "auto";
    document.getElementById("lightbox").style.display = "none";
});